[
{
"siglas": "TM-2300",
"nombre": "Expresión artística a través del dibujo",
"descripcion": "Este curso le permite a los o las estudiantes mejorar las destrezas adquiridas en el curso de Fundamentos de dibujo, de forma tal que puedan hacer diseños más realistas y con ideas propias. Además, el curso ayuda a estimular la imaginación y a tener una mayor percepción de las estructuras de los objetos o figuras que el o la estudiante desee dibujar.",
"objetivosGenerales": [
"Desarrollar en el o la estudiante las competencias necesarias para registrar gráficamente ideas y objetos a través de un trazo ágil, espontáneo y personal sobre soportes gráficos como el papel."
],
"objetivosEspecificos": [
"Enlistar los elementos formales que se utilizan para crear un dibujo.",
"Adquirir los conocimientos y experiencias necesarios en la práctica del dibujo para aplicarlos a la práctica de su profesión.",
"Realizar un dibujo tomando en consideración elementos estéticos de expresión relacionados a los elementos y principios del arte.",
"Utilizar eficientemente diferentes medios y técnicas de dibujo.",
"Utilizar líneas, formas, luz, sombra y otros elementos del dibujo como una forma sencilla de comunicarnos.",
"Hacer trabajos creativos bidimensionales desarrollados conceptualmente.",
"Conocer diferentes metodologías proyectuales para la observación, investigación y representación gráfica del cuerpo humano con mayor profundidad."
],
"contenidos": [
{
"titulo": "El espacio de trabajo y las leyes ópticas.",
"temas": [
"Ubicación espacial, posición, dirección.",
"Escorzos; metodología para la representación de la contracción proyectiva.",
"Ejes de gravedad."
]
},
{
"titulo": "Teoría de la percepción",
"temas": [
"Los principios de la Psicología de la percepción.",
"Comprender los modos mediante los cuales traducimos la realidad en términos de imagen.",
"Distinguir entre lo “visto” y lo “proyectado”.",
"Las consecuencias a la hora de dibujar."
]
},
{
"titulo": "Las temáticas del dibujo",
"temas": [
"Morfología general de la figura humana.",
"Dibujo subjetivo.",
"Dibujo de paisaje."
]
}
]
}
]
