[
  {
    "siglas": "TM-1400",
    "nombre": "Fundamentos de dibujo",
    "descripcion": "El dibujo es fundamental en la creación de obras de arte. Este curso ayudará a que el o la estudiante aumente su destreza en la observación y a la vez logre conceptualizar de una mejor forma sus interpretaciones mediante el dibujo.",
    "objetivosGenerales": [
      "Desarrollar en el o la estudiante las capacidades de observación e interpretación de tal forma que pueda realizar representaciones por medio del dibujo de una forma espontánea."
    ],
    "objetivosEspecificos": [
      "Conocer los conceptos teórico-prácticos del dibujo como forma de comunicación y expresión artística.",
      "Acrecentar en el o la estudiante las capacidades de conceptualización visual bi y tridimensional, creatividad, expresividad y comunicación visual.",
      "Adquirir una base sólida y fundamental para desarrollar otras actividades creativas y compositivas.",
      "Distinguir los elementos del dibujo: líneas, formas, texturas, luz y sombra, proporción, composición y manejo del espacio.",
      "Utilizar los elementos del dibujo en las diferentes representaciones artísticas y compositivas.",
      "Emplear diferentes materiales y técnicas para dibujar.",
      "Conceptualizar y esbozar proyectos gráficos bi y tridimensionales."
    ],
    "contenidos": [
      {
        "titulo": "Forma, composición y dibujo",
        "temas": [
          "Observación e interpretación gráfica:",
          "Elementos configuradores del dibujo:"
        ]
      },
      {
        "titulo": "La gramática del dibujo.",
        "temas": [
          "Elementos que determinan la imagen gráfica",
          "Sintaxis de los elementos que configuran la imagen gráfica."
        ]
      },
      {
        "titulo": "Estudio de la línea.",
        "temas": [
          "La expresión estructural lineal (el encaje).",
          "Características expresivas del trazo.",
          "Concepto y características de las distintas líneas."
        ]
      },
      {
        "titulo": "Luz y sombra (tonos y claroscuro).",
        "temas": [
          "La expresión volumétrica tonal.",
          "Los tonos y el claroscuro.",
          "La representación y expresión de la forma."
        ]
      }
    ]
  }
]